kiffie/pic32-pac/pic32mx470/pic32mx37xfxxxl/PIC32MX370F512L.svd
<?xml version="1.0" encoding="UTF-8"?>
<device>
  <name>PIC32MX370F512L</name>
  <peripherals>
    <peripheral>
      <name>WDT</name>
      <description>WDT peripheral</description>
      <baseAddress>0xbf800000</baseAddress>
      <registers>
        <register>
          <name>WDTCON</name>
          <description>WDTCON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>WDTCLR</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>WDTWINEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SWDTPS</name>
              <bitRange>[6:2]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTCONCLR</name>
          <description>WDTCONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>WDTCLR</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>WDTWINEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SWDTPS</name>
              <bitRange>[6:2]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTCONSET</name>
          <description>WDTCONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>WDTCLR</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>WDTWINEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SWDTPS</name>
              <bitRange>[6:2]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTCONINV</name>
          <description>WDTCONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>WDTCLR</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>WDTWINEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SWDTPS</name>
              <bitRange>[6:2]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RTCC</name>
      <description>RTCC peripheral</description>
      <baseAddress>0xbf800200</baseAddress>
      <registers>
        <register>
          <name>RTCCON</name>
          <description>RTCCON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RTCOE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HALFSEC</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RTCSYNC</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RTCWREN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RTCCLKON</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RTSECSEL</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CAL</name>
              <bitRange>[25:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCCONCLR</name>
          <description>RTCCONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RTCOE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HALFSEC</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RTCSYNC</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RTCWREN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RTCCLKON</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RTSECSEL</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CAL</name>
              <bitRange>[25:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCCONSET</name>
          <description>RTCCONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RTCOE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HALFSEC</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RTCSYNC</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RTCWREN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RTCCLKON</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RTSECSEL</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CAL</name>
              <bitRange>[25:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCCONINV</name>
          <description>RTCCONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RTCOE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HALFSEC</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RTCSYNC</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RTCWREN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RTCCLKON</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RTSECSEL</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CAL</name>
              <bitRange>[25:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCALRM</name>
          <description>RTCALRM register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ARPT</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>AMASK</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>ALRMSYNC</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>PIV</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CHIME</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ALRMEN</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCALRMCLR</name>
          <description>RTCALRMCLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ARPT</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>AMASK</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>ALRMSYNC</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>PIV</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CHIME</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ALRMEN</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCALRMSET</name>
          <description>RTCALRMSET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ARPT</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>AMASK</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>ALRMSYNC</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>PIV</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CHIME</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ALRMEN</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCALRMINV</name>
          <description>RTCALRMINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ARPT</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>AMASK</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>ALRMSYNC</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>PIV</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CHIME</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ALRMEN</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCTIME</name>
          <description>RTCTIME register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SEC01</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>SEC10</name>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>MIN01</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>MIN10</name>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>HR01</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>HR10</name>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCTIMECLR</name>
          <description>RTCTIMECLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SEC01</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>SEC10</name>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>MIN01</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>MIN10</name>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>HR01</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>HR10</name>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCTIMESET</name>
          <description>RTCTIMESET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SEC01</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>SEC10</name>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>MIN01</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>MIN10</name>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>HR01</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>HR10</name>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCTIMEINV</name>
          <description>RTCTIMEINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SEC01</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>SEC10</name>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>MIN01</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>MIN10</name>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>HR01</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>HR10</name>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCDATE</name>
          <description>RTCDATE register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>WDAY01</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>DAY01</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>DAY10</name>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>MONTH01</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>MONTH10</name>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>YEAR01</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>YEAR10</name>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCDATECLR</name>
          <description>RTCDATECLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>WDAY01</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>DAY01</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>DAY10</name>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>MONTH01</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>MONTH10</name>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>YEAR01</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>YEAR10</name>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCDATESET</name>
          <description>RTCDATESET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>WDAY01</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>DAY01</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>DAY10</name>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>MONTH01</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>MONTH10</name>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>YEAR01</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>YEAR10</name>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCDATEINV</name>
          <description>RTCDATEINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>WDAY01</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>DAY01</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>DAY10</name>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>MONTH01</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>MONTH10</name>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>YEAR01</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>YEAR10</name>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ALRMTIME</name>
          <description>ALRMTIME register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SEC01</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>SEC10</name>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>MIN01</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>MIN10</name>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>HR01</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>HR10</name>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ALRMTIMECLR</name>
          <description>ALRMTIMECLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SEC01</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>SEC10</name>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>MIN01</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>MIN10</name>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>HR01</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>HR10</name>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
