kiffie/pic32-pac/pic32mx470/pic32mx37xfxxxl/PIC32MX370F512L.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>UART3</name>
      <description>UART3 peripheral</description>
      <baseAddress>0xbf806400</baseAddress>
      <registers>
        <register>
          <name>U3MODE</name>
          <description>U3MODE register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STSEL</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PDSEL</name>
              <bitRange>[2:1]</bitRange>
            </field>
            <field>
              <name>BRGH</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RXINV</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ABAUD</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LPBACK</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>WAKE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>UEN</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>RTSMD</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>IREN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U3MODECLR</name>
          <description>U3MODECLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STSEL</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PDSEL</name>
              <bitRange>[2:1]</bitRange>
            </field>
            <field>
              <name>BRGH</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RXINV</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ABAUD</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LPBACK</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>WAKE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>UEN</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>RTSMD</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>IREN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U3MODESET</name>
          <description>U3MODESET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STSEL</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PDSEL</name>
              <bitRange>[2:1]</bitRange>
            </field>
            <field>
              <name>BRGH</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RXINV</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ABAUD</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LPBACK</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>WAKE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>UEN</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>RTSMD</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>IREN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U3MODEINV</name>
          <description>U3MODEINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STSEL</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PDSEL</name>
              <bitRange>[2:1]</bitRange>
            </field>
            <field>
              <name>BRGH</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RXINV</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ABAUD</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LPBACK</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>WAKE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>UEN</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>RTSMD</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>IREN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U3STA</name>
          <description>U3STA register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>272</resetValue>
          <fields>
            <field>
              <name>URXDA</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OERR</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>FERR</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PERR</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RIDLE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADDEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>URXISEL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>TRMT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>UTXBF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>UTXEN</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>UTXBRK</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>URXEN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UTXINV</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>UTXISEL</name>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>ADDR</name>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>ADM_EN</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U3STACLR</name>
          <description>U3STACLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>URXDA</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OERR</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>FERR</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PERR</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RIDLE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADDEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>URXISEL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>TRMT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>UTXBF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>UTXEN</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>UTXBRK</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>URXEN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UTXINV</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>UTXISEL</name>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>ADDR</name>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>ADM_EN</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U3STASET</name>
          <description>U3STASET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>URXDA</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OERR</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>FERR</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PERR</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RIDLE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADDEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>URXISEL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>TRMT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>UTXBF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>UTXEN</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>UTXBRK</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>URXEN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UTXINV</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>UTXISEL</name>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>ADDR</name>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>ADM_EN</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U3STAINV</name>
          <description>U3STAINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>URXDA</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OERR</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>FERR</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PERR</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RIDLE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADDEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>URXISEL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>TRMT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>UTXBF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>UTXEN</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>UTXBRK</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>URXEN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UTXINV</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>UTXISEL</name>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>ADDR</name>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>ADM_EN</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U3TXREG</name>
          <description>U3TXREG register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U3TXREG</name>
              <bitRange>[8:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U3RXREG</name>
          <description>U3RXREG register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U3RXREG</name>
              <bitRange>[8:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U3BRG</name>
          <description>U3BRG register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BRG</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U3BRGCLR</name>
          <description>U3BRGCLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BRG</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U3BRGSET</name>
          <description>U3BRGSET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BRG</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U3BRGINV</name>
          <description>U3BRGINV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BRG</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
