kiffie/pic32-pac/pic32mx470/pic32mx37xfxxxl/PIC32MX370F512L.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CMP2</name>
      <description>CMP2 peripheral</description>
      <baseAddress>0xbf80a010</baseAddress>
      <registers>
        <register>
          <name>CM2CON</name>
          <description>CM2CON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>195</resetValue>
          <fields>
            <field>
              <name>CCH</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CREF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EVPOL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>COUT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>COE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CM2CONCLR</name>
          <description>CM2CONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CCH</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CREF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EVPOL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>COUT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>COE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CM2CONSET</name>
          <description>CM2CONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CCH</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CREF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EVPOL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>COUT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>COE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CM2CONINV</name>
          <description>CM2CONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CCH</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CREF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EVPOL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>COUT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>COE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CMP</name>
      <description>CMP peripheral</description>
      <baseAddress>0xbf80a060</baseAddress>
      <registers>
        <register>
          <name>CMSTAT</name>
          <description>CMSTAT register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>C1OUT</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>C2OUT</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMSTATCLR</name>
          <description>CMSTATCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>C1OUT</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>C2OUT</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMSTATSET</name>
          <description>CMSTATSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>C1OUT</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>C2OUT</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMSTATINV</name>
          <description>CMSTATINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>C1OUT</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>C2OUT</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
