kiffie/pic32-pac/pic32mx470/pic32mx37xfxxxl/PIC32MX370F512L.svd
        <register>
          <name>CNENACLR</name>
          <description>CNENACLR register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIEA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNIEA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENASET</name>
          <description>CNENASET register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIEA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNIEA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENAINV</name>
          <description>CNENAINV register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIEA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNIEA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATA</name>
          <description>CNSTATA register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATACLR</name>
          <description>CNSTATACLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATASET</name>
          <description>CNSTATASET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATAINV</name>
          <description>CNSTATAINV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
