kiffie/pic32-pac/pic32mx470/pic32mx37xfxxxl/PIC32MX370F512L.svd
        <register>
          <name>CNSTATB</name>
          <description>CNSTATB register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATB6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNSTATB12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATBCLR</name>
          <description>CNSTATBCLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATB6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNSTATB12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATBSET</name>
          <description>CNSTATBSET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATB6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNSTATB12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATBINV</name>
          <description>CNSTATBINV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATB6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNSTATB12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
