kiffie/pic32-pac/pic32mx470/pic32mx37xfxxxl/PIC32MX370F512L.svd
        <register>
          <name>CNPUCSET</name>
          <description>CNPUCSET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPUC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUCINV</name>
          <description>CNPUCINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPUC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDC</name>
          <description>CNPDC register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPDC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDCCLR</name>
          <description>CNPDCCLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPDC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDCSET</name>
          <description>CNPDCSET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPDC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDCINV</name>
          <description>CNPDCINV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPDC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONC</name>
          <description>CNCONC register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONCCLR</name>
          <description>CNCONCCLR register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONCSET</name>
          <description>CNCONCSET register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONCINV</name>
          <description>CNCONCINV register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENC</name>
          <description>CNENC register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIEC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNIEC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENCCLR</name>
          <description>CNENCCLR register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIEC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNIEC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENCSET</name>
          <description>CNENCSET register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIEC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNIEC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENCINV</name>
          <description>CNENCINV register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIEC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNIEC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATC</name>
          <description>CNSTATC register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATCCLR</name>
          <description>CNSTATCCLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATCSET</name>
          <description>CNSTATCSET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATCINV</name>
          <description>CNSTATCINV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
