kiffie/pic32-pac/pic32mx470/pic32mx37xfxxxl/PIC32MX370F512L.svd
        <register>
          <name>CNSTATDSET</name>
          <description>CNSTATDSET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNSTATD12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATD13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATD14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATD15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATDINV</name>
          <description>CNSTATDINV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNSTATD12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATD13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATD14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATD15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PORTE</name>
      <description>PORTE peripheral</description>
      <baseAddress>0xbf886400</baseAddress>
      <registers>
        <register>
          <name>ANSELE</name>
          <description>ANSELE register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>244</resetValue>
          <fields>
            <field>
              <name>ANSE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ANSE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ANSE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ANSE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ANSE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELECLR</name>
          <description>ANSELECLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ANSE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ANSE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ANSE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ANSE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ANSE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELESET</name>
          <description>ANSELESET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ANSE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ANSE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ANSE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ANSE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ANSE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELEINV</name>
          <description>ANSELEINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ANSE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ANSE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ANSE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ANSE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ANSE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISE</name>
          <description>TRISE register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>1023</resetValue>
          <fields>
            <field>
              <name>TRISE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISECLR</name>
          <description>TRISECLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISESET</name>
          <description>TRISESET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISEINV</name>
          <description>TRISEINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTE</name>
          <description>PORTE register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTECLR</name>
          <description>PORTECLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTESET</name>
          <description>PORTESET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTEINV</name>
          <description>PORTEINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATE</name>
          <description>LATE register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATECLR</name>
          <description>LATECLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATESET</name>
          <description>LATESET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
