kiffie/pic32-pac/pic32mx470/pic32mx37xfxxxl/PIC32MX370F512L.svd
        <register>
          <name>LATEINV</name>
          <description>LATEINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCE</name>
          <description>ODCE register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCECLR</name>
          <description>ODCECLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCESET</name>
          <description>ODCESET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCEINV</name>
          <description>ODCEINV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUE</name>
          <description>CNPUE register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUECLR</name>
          <description>CNPUECLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUESET</name>
          <description>CNPUESET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUEINV</name>
          <description>CNPUEINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDE</name>
          <description>CNPDE register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDECLR</name>
          <description>CNPDECLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDESET</name>
          <description>CNPDESET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDEINV</name>
          <description>CNPDEINV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONE</name>
          <description>CNCONE register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONECLR</name>
          <description>CNCONECLR register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONESET</name>
          <description>CNCONESET register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONEINV</name>
          <description>CNCONEINV register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENE</name>
          <description>CNENE register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENECLR</name>
          <description>CNENECLR register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
