kiffie/pic32-pac/pic32mx470/pic32mx37xfxxxl/PIC32MX370F512L.svd
        <register>
          <name>CNENESET</name>
          <description>CNENESET register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENEINV</name>
          <description>CNENEINV register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATE</name>
          <description>CNSTATE register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATECLR</name>
          <description>CNSTATECLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATESET</name>
          <description>CNSTATESET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATEINV</name>
          <description>CNSTATEINV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
