kiffie/pic32-pac/pic32mx470/pic32mx37xfxxxl/PIC32MX370F512L.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PORTF</name>
      <description>PORTF peripheral</description>
      <baseAddress>0xbf886500</baseAddress>
      <registers>
        <register>
          <name>ANSELF</name>
          <description>ANSELF register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields />
        </register>
        <register>
          <name>ANSELFCLR</name>
          <description>ANSELFCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields />
        </register>
        <register>
          <name>ANSELFSET</name>
          <description>ANSELFSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields />
        </register>
        <register>
          <name>ANSELFINV</name>
          <description>ANSELFINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields />
        </register>
        <register>
          <name>TRISF</name>
          <description>TRISF register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>12799</resetValue>
          <fields>
            <field>
              <name>TRISF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISF6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISF7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TRISF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISFCLR</name>
          <description>TRISFCLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISF6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISF7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TRISF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISFSET</name>
          <description>TRISFSET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISF6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISF7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TRISF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISFINV</name>
          <description>TRISFINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISF6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISF7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TRISF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTF</name>
          <description>PORTF register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RF6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RF7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>RF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTFCLR</name>
          <description>PORTFCLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RF6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RF7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>RF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTFSET</name>
          <description>PORTFSET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RF6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RF7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>RF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTFINV</name>
          <description>PORTFINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RF6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RF7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>RF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATF</name>
          <description>LATF register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATF6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATF7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LATF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATFCLR</name>
          <description>LATFCLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATF6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATF7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LATF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATFSET</name>
          <description>LATFSET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATF6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATF7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LATF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATFINV</name>
          <description>LATFINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATF6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATF7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LATF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCF</name>
          <description>ODCF register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCF6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCF7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ODCF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCFCLR</name>
          <description>ODCFCLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCF6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCF7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ODCF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
