kiffie/pic32-pac/pic32mx470/pic32mx37xfxxxl/PIC32MX370F512L.svd
        <register>
          <name>ODCFSET</name>
          <description>ODCFSET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCF6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCF7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ODCF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCFINV</name>
          <description>ODCFINV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCF6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCF7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ODCF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUF</name>
          <description>CNPUF register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUF6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUF7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUFCLR</name>
          <description>CNPUFCLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUF6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUF7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUFSET</name>
          <description>CNPUFSET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUF6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUF7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUFINV</name>
          <description>CNPUFINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUF6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUF7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDF</name>
          <description>CNPDF register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDF6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDF7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDFCLR</name>
          <description>CNPDFCLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDF6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDF7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDFSET</name>
          <description>CNPDFSET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDF6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDF7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDFINV</name>
          <description>CNPDFINV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDF6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDF7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONF</name>
          <description>CNCONF register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONFCLR</name>
          <description>CNCONFCLR register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONFSET</name>
          <description>CNCONFSET register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONFINV</name>
          <description>CNCONFINV register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENF</name>
          <description>CNENF register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEF6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEF7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIEF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENFCLR</name>
          <description>CNENFCLR register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEF6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEF7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIEF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENFSET</name>
          <description>CNENFSET register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEF6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEF7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIEF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
