kiffie/pic32-pac/pic32mx470/pic32mx37xfxxxl/PIC32MX370F512L.svd
        <register>
          <name>CNENFINV</name>
          <description>CNENFINV register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEF6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEF7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIEF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATF</name>
          <description>CNSTATF register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATF6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATF7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATFCLR</name>
          <description>CNSTATFCLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATF6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATF7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATFSET</name>
          <description>CNSTATFSET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATF6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATF7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATFINV</name>
          <description>CNSTATFINV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATF6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATF7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
