kiffie/pic32-pac/pic32mx470/pic32mx37xfxxxl/PIC32MX370F512L.svd
        <register>
          <name>ODCG</name>
          <description>ODCG register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ODCG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ODCG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCGCLR</name>
          <description>ODCGCLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ODCG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ODCG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCGSET</name>
          <description>ODCGSET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ODCG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ODCG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCGINV</name>
          <description>ODCGINV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ODCG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ODCG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUG</name>
          <description>CNPUG register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPUG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUGCLR</name>
          <description>CNPUGCLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPUG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUGSET</name>
          <description>CNPUGSET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPUG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUGINV</name>
          <description>CNPUGINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPUG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDG</name>
          <description>CNPDG register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPDG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDGCLR</name>
          <description>CNPDGCLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPDG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDGSET</name>
          <description>CNPDGSET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPDG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDGINV</name>
          <description>CNPDGINV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPDG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONG</name>
          <description>CNCONG register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONGCLR</name>
          <description>CNCONGCLR register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONGSET</name>
          <description>CNCONGSET register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONGINV</name>
          <description>CNCONGINV register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
