kiffie/pic32-pac/pic32mx470/pic32mx37xfxxxl/PIC32MX370F512L.svd
        <register>
          <name>CNENG</name>
          <description>CNENG register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIEG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIEG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNIEG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENGCLR</name>
          <description>CNENGCLR register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIEG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIEG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNIEG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENGSET</name>
          <description>CNENGSET register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIEG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIEG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNIEG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENGINV</name>
          <description>CNENGINV register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIEG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIEG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNIEG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATG</name>
          <description>CNSTATG register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATGCLR</name>
          <description>CNSTATGCLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATGSET</name>
          <description>CNSTATGSET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATGINV</name>
          <description>CNSTATGINV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATG2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATG3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
