kiffie/pic32-pac/pic32mx470/pic32mx37xfxxxl/PIC32MX370F512L.svd
        <register>
          <name>PMD6INV</name>
          <description>PMD6INV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RTCCMD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>REFOMD</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PMPMD</name>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>NVM</name>
      <description>NVM peripheral</description>
      <baseAddress>0xbf80f400</baseAddress>
      <registers>
        <register>
          <name>NVMCON</name>
          <description>NVMCON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMOP</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>LVDSTAT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LVDERR</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>WRERR</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>WREN</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>WR</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMCONCLR</name>
          <description>NVMCONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMOP</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>LVDSTAT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LVDERR</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>WRERR</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>WREN</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>WR</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMCONSET</name>
          <description>NVMCONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMOP</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>LVDSTAT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LVDERR</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>WRERR</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>WREN</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>WR</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMCONINV</name>
          <description>NVMCONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMOP</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>LVDSTAT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LVDERR</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>WRERR</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>WREN</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>WR</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMKEY</name>
          <description>NVMKEY register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMKEY</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMADDR</name>
          <description>NVMADDR register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMADDRCLR</name>
          <description>NVMADDRCLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMADDRSET</name>
          <description>NVMADDRSET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMADDRINV</name>
          <description>NVMADDRINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMDATA</name>
          <description>NVMDATA register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMDATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMSRCADDR</name>
          <description>NVMSRCADDR register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMSRCADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
